import { toMap, pickedDoll, solution } from './solution';

test('주어지는 board를 map으로 변경', () => {
  expect(toMap([
    [0, 0, 0, 0, 0],
    [0, 0, 1, 0, 3],
    [0, 2, 5, 0, 1],
    [4, 2, 4, 4, 2],
    [3, 5, 1, 3, 1],
  ]))
    .toEqual(
      new Map(
        [[1, [3, 4]],
          [2, [5, 2, 2]],
          [3, [1, 4, 5, 1]],
          [4, [3, 4]],
          [5, [1, 2, 1, 3]],
        ],
      ),
    );
});

test('moves 반영해서 삭제되는 인형의 수 반환', () => {
  expect(pickedDoll(new Map(
    [[1, [3, 4]],
      [2, [5, 2, 2]],
      [3, [1, 4, 5, 1]],
      [4, [3, 4]],
      [5, [1, 2, 1, 3]],
    ],
  ), [1, 5, 3, 5, 1, 2, 1, 4]));
});

test('solution', () => {
  expect(solution([
    [0, 0, 0, 0, 0],
    [0, 0, 1, 0, 3],
    [0, 2, 5, 0, 1],
    [4, 2, 4, 4, 2],
    [3, 5, 1, 3, 1],
  ], [1, 5, 3, 5, 1, 2, 1, 4])).toBe(4);
});
